class Config {

  constructor() {

  }


}

// url
Config.restUrl = 'http://zhaopin.com/api/'

// 年龄
const date = new Date()
let age_data = []
for (let i = date.getFullYear(); i >= 1962; i--) { age_data.push(i) }

Config.age_data = age_data

// 期望岗位
Config.expectation_position_data = [
  '销售', '客服', '普工/技工', '人事/行政/后勤', '餐饮', '旅游', '酒店', '超市/百货/零售', '美容/美发', '保健/按摩', '运动健身',
  '服装/纺织/食品', '生产管理/研发', '建筑', '物业管理', '房产中介', '家政保洁/安保', '司机/交通服务', '物流/仓储', '贸易/采购',
  '汽车制造/服务', '淘宝职位', '美术/设计/创意', '化工', '市场/媒介/公关', '广告/会展/咨询', '娱乐/休闲', '教育/培训',
  '财务/审计/统计', '法律', '翻译', '编辑/出版/印刷', '计算机/互联网/通信', '电子/电器', '机械/仪器仪表', '金融/银行/证劵/投资',
  '保险', '医院/医疗/护理', '环保/能源', '制药/生物工程', '质控/安防', '农/林/牧/渔业', '其他职位'
]

// 期望薪资 - 与岗位的薪资水平共用
Config.expectation_pay_data = [
  '面议', '1000元以下', '1000-2000元', '2000-3000元', '3000-5000元', '5000-8000元', '8000-12000元', '12000-20000元', '20000元以上'
]

// 性别
Config.sex_data = ['男', '女']

// 经验
Config.work_exp_data = ['无经验', '应届生', '1年以下', '1-3年', '3-5年', '5-10年', '10年以上']

// 学历
Config.education_data = ['初中', '中专/技校', '高中', '大专', '本科', '硕士', '博士', 'MBA/EMBA']

// 求职区域 - 与岗位的工作区域共用
Config.work_place_data = ['曲靖', '麒麟', '沾益']

// 工作性质
Config.work_nature_data = ['全职', '兼职', '全职/兼职']

// 到岗时间
Config.report_time_data = ['随时到岗', '一周以内', '两周以内', '一月以内', '无法确定']

// 目前状态
Config.current_state_data = ['已离职', '暂未离职']


//---------------------公司组----------------------

//公司规模
Config.company_size_data = ['1-49人', '50-99人', '100-499人', '500-999人', '1000人以上']

//公司性质
Config.company_nature_data = ['私营', '国有', '股份制', '外贸独资/ 办事处', '中外合资/ 合作', '上市公司', '事业单位', '非营利机构', '个人企业']

//公司所属行业
Config.company_industry_data = [
  '娱乐休闲/餐饮/服务', '医疗/保健/卫生/美容', '金融/银行', '互联网/电子商务', '教育/科研/培训', '批发/零售', '发地产/物业管理', '陶瓷卫浴',
  '家居灯饰', '租赁服务', '咨询/顾问', '办公用品及设备', '保险', '汽车/摩托车', '旅游/酒店', '广告/创意', '服装/纺织/皮革', '中介/专业服务',
  '建筑/建材', '家居/室内设计/装潢', '贸易/进出口', '交通/运输/物流', '人力资源服务', '计算机软件', '计算机硬件', '原材料和加工',
  '媒体传播', '游戏', '农林牧渔', '化工/采掘/冶炼', '多元化集团', '其他行业'
]


//-------------------------------------------------------岗位组------------------------------------------------------

//岗位福利
Config.job_welfare = [
  { value: '环境好' },
  { value: '五险一金' },
  { value: '包吃' },
  { value: '包住' },
  { value: '饭补' },
  { value: '话补' },
  { value: '周末双休' },
  { value: '加班补助' }
]


// 工作经验要求：
Config.ments_exp = ['不限', '1年以下', '1-2年', '3-5年']

// 学历要求
Config.ments_education = ['不限', '初中以上', '高中以上', '大专以上', '本科', '硕士', '博士', 'MBA/EMBA']

// 性别要求：
Config.ments_sex = ['不限', '男', '女']



export { Config }